from dataclasses import dataclass

@dataclass(frozen=True)
class CategoryInfo:
    image: str
    text: str

CATEGORIES = {
    "Документы": CategoryInfo(
        image="assets/images/documents.jpg",
        text=(
            "Если тебя интересует один из перечисленных вопросов — тебе необходимо обратиться в Учебный отдел📚\n"
            "Он находится в 11-ом корпусе в самом конце коридора."
        )
    ),
    "Учебный процесс": CategoryInfo(
        image="assets/images/study.jpg",
        text=(
            "Если тебя интересует один из перечисленных вопросов — тебе необходимо обратиться на свою кафедру⚡️\n"
            "Кафедры расположены на 4-ом этаже рядом со столовой.\n\n"
            "💡Подсказка💡\n"
            "Свою кафедру вы можете узнать по первым буквам в названии группы:\n"
            "— Д — Кафедра дизайна\n"
            "— ИБ — Кафедра информационной безопасности\n"
            "— ИТ — Кафедра информационных технологий\n"
            "— МК — Кафедра маркетинга\n"
            "— РИ — Кафедра разработки игр"
        )
    ),
    "Служба заботы": CategoryInfo(
        image="assets/images/support.jpg",
        text=(
            "Если тебя интересует один из перечисленных вопросов — тебе необходимо обратиться в кабинет Службы заботы💜\n"
            "Он находится в 15-ом корпусе во 2-ом крыле 3-его этажа, рядом с аудиториями 3.10 и 3.11."
        )
    ),
    "Другое": CategoryInfo(
        image="assets/images/other.jpg",
        text="Если ни один из пунктов тебе не подошел, можешь ознакомиться с нашим дополнительным меню:"
    )
}

SUBCATEGORIES = {
    "Обратная связь": CategoryInfo(
        image="assets/images/feedback.jpg",
        text=(
            "Здесь ты можешь оставить обратную связь касаемо работы или задать интересующие тебя вопросы:\n\n"
            "👾Напоминаем, пока ваше обращение не рассмотренно — вы не можете создать новое. "
            "Бот не предназначен для ведения диалога и не получает ваши ответы👾\n\n"
            "Примечание: в одном обращении можно прикрепить только 1 медиафайл"
        )
    ),
    "Проблемы с техникой": CategoryInfo(
        image="assets/images/tech_issues.jpg",
        text=(
            "Если ты столкнулся с какой-то технической проблемой — подробно опиши ее в формате:\n"
            "1. Название и номер устройства\n"
            "2. Описание проблемы\n\n"
            "👾Напоминаем, пока ваше обращение не рассмотренно — вы не можете создать новое. "
            "Бот не предназначен для ведения диалога и не получает ваши ответы👾\n\n"
            "Примечание: в одном обращении можно прикрепить только 1 медиафайл"
        )
    ),
    "Срочная помощь": CategoryInfo(
        image="assets/images/redbutton.jpg",
        text=(
            "Данная кнопка предназначена для того чтобы ты мог анонимно рассказать о чрезвычайных ситуациях, с которыми ты столкнулся.\n\n"
            "👾Напоминаем, пока ваше обращение не рассмотренно — вы не можете создать новое. "
            "Бот не предназначен для ведения диалога и не получает ваши ответы👾\n\n"
            "Примечание: в одном обращении можно прикрепить только 1 медиафайл"
        )
    ),
    "Запрос на печать": CategoryInfo(
        image="assets/images/other.jpg",
        text=(
            "Если тебе необходимо распечатать материал — подробно распиши, как именно это нужно сделать. "
            "Мы рекомендуем отправлять материалы заранее вместе с описанием:\n\n"
            "1. Сколько экземпляров необходимо? Какие страницы нужны?\n"
            "2. Односторонняя или двухсторонняя печать?\n"
            "3. К какому времени необходимо распечатать данные материалы? В каком корпусе будет удобно их забрать?\n"
            "4. Дополнительная информация.\n\n"
            "Файл необходимо прикрепить в одном сообщении с запросом. Если ваш запрос не соответствует форме — он не будет принят.\n\n"
            "⚫️ Обратите внимание, печать осуществляется только в чёрно-белом формате. ⚪️\n\n"
            "👾 Напоминаем: пока ваше обращение не рассмотрено — вы не можете создать новое. "
            "Бот не предназначен для ведения диалога и не получает ваши ответы. 👾\n\n"
            "Примечание: в одном обращении можно прикрепить только 1 файл для печати"
        )
    )
}

START_INFO = CategoryInfo(
    image="assets/images/welcome.jpg",
    text=(
        "Привет, {full_name}!\n"
        "Мы знаем, что у тебя могло возникнуть множество вопросов, и с радостью готовы помочь тебе их решить 💜\n\n"
        "Выбери категорию, к которой относится твой вопрос:"
    )
)

FEEDBACK_NOTIFICATION_TEMPLATE = (
    "Новое обращение от {sender_display_name}:\n"
    "Категория: {category}\n\n"
    "{message_text}"
)

URGENT_FEEDBACK_NOTIFICATION_TEMPLATE = (
    "🚨 *АХТУНГ!* 🚨\n"
    "Пользователь: {sender_display_name}\n\n"
    "Сообщение:\n"
    "{message_text}"
)

PRINT_REQUEST_NOTIFICATION_TEMPLATE = (
    "🖨 Запрос на печать 🖨\n"
    "Пользователь: {sender_display_name}\n\n"
    "Текст запроса:\n"
    "{message_text}"
)

ACKNOWLEDGMENT_CAPTION = (
    "Спасибо! Твое сообщение отправлено в службу поддержки.\n\n"
    "👾Напоминаем, пока ваше обращение не рассмотренно — вы не можете создать новое. Бот не предназначен для ведения диалога и не получает ваши ответы👾\n\n"
    "Примечание: в одном обращении можно прикрепить только 1 медиафайл"
)

ACKNOWLEDGMENT_IMAGE_PATH = "assets/images/support_received.jpg"

CATEGORIES_LIST = list(CATEGORIES.keys())
